Конфигурация/Reports/РезультатыОбработкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>РезультатыОбработкиОтчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОтчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЖурналСобытийСОтчетами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСобытийСОтчетами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыДанныхКОбработке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Экземпляр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияСОтчетами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СобытияСОтчетами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СобытияСОтчетами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановкаЗапретаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеЗапретаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаВерсииИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаОкончательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеОкончательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеВыгрузкиВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыгрузкиВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнаяЗагрузкаВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаРучнойЗагрузкиВЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеПисьма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОтправкиПисьмом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаПисьмом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеПисьмаПоПросьбе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОтправкиПисьмомПоПросьбе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаПисьмомПоПросьбе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВариантыОпределенияКонечнойДатыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОпределенияКонечнойДатыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоследнийРабочийДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ПериодичностьПредоставленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПериодичностьПредоставленияОтчетности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ежедневно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Еженедельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДваРазаВМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ежегодно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДекадам</Name>
					<Comment>с 1 по 10, с 11 по 20, с 21 до конца месяца</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Reports/РезультатыОбработкиОтчетов/Ext/ObjectModule.bsl
// Возвращает табличный документ с результатом формирования отчета
//	Параметры:
//		- УчитываяСрокФормирования	- учитывать значение настройки "Срок формирования" или нет
//		- Отбор						- структура с возможными параметрами отбора
//		- ВыводитьВсе				- необходимость вывода не только отклонений (не только не выполненные действия)
//
Функция Сформировать(УчитываяСрокФормирования = Истина, Отбор = Неопределено, ВыводитьВсе = Ложь) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Дата,Организация,ГруппаОтчетов");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	ЦветОшибка	= Новый Цвет(255, 0, 0);
	ЦветУспешно	= Новый Цвет(0, 150, 70);
	
	Результат = Новый ТабличныйДокумент;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ГруппаОтчетов) Тогда
		
		Если Отбор = Неопределено Тогда
			Отбор = Новый Структура("ГруппаОтчетов", ЭтотОбъект.ГруппаОтчетов);
		Иначе
			Отбор.Вставить("ГруппаОтчетов", ЭтотОбъект.ГруппаОтчетов);
		КонецЕсли;
		
	КонецЕсли;
	
	СоставИНастройкиОтчетов = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьСоставИНастройкиОтчетовНаДату(ЭтотОбъект.Организация, ЭтотОбъект.Дата, УчитываяСрокФормирования, Отбор);
	
	ТипИдентификатора = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36, ДопустимаяДлина.Переменная));
	СоставИНастройкиОтчетов.Колонки.Добавить("ИдентификаторСтроки", ТипИдентификатора);
	
	Для Каждого Отчет Из СоставИНастройкиОтчетов Цикл
		Отчет.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
	СостоянияОтчетов = РаботаСОтчетами.ПолучитьСостоянияОтчетов(ЭтотОбъект.Организация, СоставИНастройкиОтчетов);
		
	// Дополнительно получаем отчеты, которые были сформированы с флагом ВсеОтчетыКромеЕжедневных (или каким-либо другим способом)
	ТаблицаОтчетовСформированныхДополнительно = ПолучитьТаблицуДоговоровСОтчетамиСформированнымиДополнительно(Отбор, СостоянияОтчетов.ВыгрузитьКолонку("Экземпляр"), УчитываяСрокФормирования);
	
	Для Каждого СтрокаОтчета Из ТаблицаОтчетовСформированныхДополнительно Цикл
		
		Если Отбор = Неопределено Тогда
			Отбор = Новый Структура("Договоры, СписокОтчетов, Периодичность", СтрокаОтчета.Договоры, СтрокаОтчета.СписокОтчетов, СтрокаОтчета.Периодичность);
		Иначе
			Отбор.Вставить("Договоры", 		СтрокаОтчета.Договоры);
			Отбор.Вставить("СписокОтчетов", СтрокаОтчета.СписокОтчетов);
			Отбор.Вставить("Периодичность", СтрокаОтчета.Периодичность);
		КонецЕсли;
	    			
		СоставИНастройкиОтчетовСформированныхДополнительно 	= РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьСоставИНастройкиОтчетовНаДату(
																	ЭтотОбъект.Организация, 
																	СтрокаОтчета.Дата, 
																	Ложь, 
																	Отбор,
																	, 
																	Истина);
																	
		СоставИНастройкиОтчетовСформированныхДополнительно.Колонки.Добавить("ИдентификаторСтроки", ТипИдентификатора);
		
		Для Каждого Отчет Из СоставИНастройкиОтчетовСформированныхДополнительно Цикл
			Отчет.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЦикла; 	
		
		СостоянияОтчетовСформированныхДополнительно			= РаботаСОтчетами.ПолучитьСостоянияОтчетов(ЭтотОбъект.Организация, СоставИНастройкиОтчетовСформированныхДополнительно);
		
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(СоставИНастройкиОтчетовСформированныхДополнительно, СоставИНастройкиОтчетов);
		РаботаСКоллекциями.ТаблицаЗначений_Дополнить(СостоянияОтчетовСформированныхДополнительно, СостоянияОтчетов);
			
	КонецЦикла;

	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаОтклонения	= Макет.ПолучитьОбласть("СтрокаОтклонения");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	
	ОшибкиСОтчетамиСВременемФормирования	= Новый ТабличныйДокумент;
	ОшибкиСОтчетамиБезВремениФормирования	= Новый ТабличныйДокумент;
	БезОшибок								= Новый ТабличныйДокумент;
	
	Сформировано	= 0;
	КВыгрузке		= 0;
	Выгружено		= 0;
	КОтправке		= 0;
	Отправлено		= 0;
	
	Для Каждого Отчет Из СоставИНастройкиОтчетов Цикл
		
		Состояние = СостоянияОтчетов.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Отчет.ИдентификаторСтроки))[0];
		
		ЕстьОшибки = Ложь;
		
		Если Состояние.Сформировать
			ИЛИ Состояние.ЗапретОбработки И Состояние.СтатусВерсии < 2 Тогда
			ЕстьОшибки = Истина;
		Иначе
			Сформировано = Сформировано + 1;
		КонецЕсли;
		
		Если Отчет.ВыгружаетсяВЭДО Тогда
			
			КВыгрузке = КВыгрузке + 1;
			
			Если Состояние.Выгрузить
				ИЛИ Состояние.ЗапретОбработки И Состояние.СтатусВыгрузки < 2 Тогда
				ЕстьОшибки = Истина;
			Иначе
				Выгружено = Выгружено + 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Отчет.ОтправляетсяПочтой Тогда
			
			КОтправке = КОтправке + 1;
			
			Если Состояние.Отправить
				ИЛИ Состояние.ЗапретОбработки И Состояние.СтатусОтправки < 2 Тогда
				ЕстьОшибки = Истина;
			Иначе
				Отправлено = Отправлено + 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьОшибки ИЛИ ВыводитьВсе Тогда
			
			ОбластьСтрокаОтклонения.Параметры.Договор			= Отчет.Субъект;
			ОбластьСтрокаОтклонения.Параметры.Отчет				= Отчет.Отчет;
			ОбластьСтрокаОтклонения.Параметры.Периодичность		= Отчет.Периодичность;
			ОбластьСтрокаОтклонения.Параметры.ОтчетнаяДата		= Отчет.Дата;
			ОбластьСтрокаОтклонения.Параметры.ВремяФормирования	= Формат(Отчет.ВремяФормирования, "ДФ=HH:mm; ДП=' - '");
			ОбластьСтрокаОтклонения.Параметры.ЗапретОбработки	= Состояние.ЗапретОбработки;
			
			Ошибка = Состояние.Сформировать ИЛИ Состояние.ЗапретОбработки И Состояние.СтатусВерсии < 2;
			
			Если Ошибка Тогда
				ОбластьСтрокаОтклонения.Область(1, 15).ЦветТекста = ЦветОшибка;
			Иначе
				ОбластьСтрокаОтклонения.Область(1, 15).ЦветТекста = ЦветУспешно;
			КонецЕсли;
			
			ОбластьСтрокаОтклонения.Параметры.Формирование = НЕ Ошибка;
			
			ОбластьСтрокаОтклонения.Параметры.ВыгрузкаВЭДО 			= Неопределено;
			ОбластьСтрокаОтклонения.Параметры.РучнаяЗагрузкаВЭДО 	= Неопределено;
			
			Если Отчет.ВыгружаетсяВЭДО Тогда
				
				Ошибка = Состояние.Выгрузить ИЛИ Состояние.ЗапретОбработки И Состояние.СтатусВыгрузки < 2;
				
				НомерКолонкиСтатуса = ?(Отчет.РучнаяЗагрузкаФайловВЭДО, 17, 16);
				Если Ошибка Тогда
					ОбластьСтрокаОтклонения.Область(1, НомерКолонкиСтатуса).ЦветТекста = ЦветОшибка;
				Иначе
					ОбластьСтрокаОтклонения.Область(1, НомерКолонкиСтатуса).ЦветТекста = ЦветУспешно;
				КонецЕсли;
							
				// Разделяем выгрузку для ручной загрузки в ЭДО от автоматического обмена с ЭДО
				Если Отчет.РучнаяЗагрузкаФайловВЭДО Тогда									
					ОбластьСтрокаОтклонения.Параметры.РучнаяЗагрузкаВЭДО = НЕ Ошибка;
				Иначе
					ОбластьСтрокаОтклонения.Параметры.ВыгрузкаВЭДО = НЕ Ошибка;
				КонецЕсли;				
				
			КонецЕсли;
			
			ОбластьСтрокаОтклонения.Параметры.ОтправкаПочтой = Неопределено;
			
			Если Отчет.ОтправляетсяПочтой Тогда
				
				Ошибка = Состояние.Отправить ИЛИ Состояние.ЗапретОбработки И Состояние.СтатусОтправки < 2;
				
				Если Ошибка Тогда
					ОбластьСтрокаОтклонения.Область(1, 18).ЦветТекста = ЦветОшибка;
				Иначе
					ОбластьСтрокаОтклонения.Область(1, 18).ЦветТекста = ЦветУспешно;
				КонецЕсли;
				
				ОбластьСтрокаОтклонения.Параметры.ОтправкаПочтой = НЕ Ошибка;
				
			КонецЕсли;
			
			Если ЕстьОшибки Тогда
				Если ЗначениеЗаполнено(Отчет.ВремяФормирования) Тогда
					ОшибкиСОтчетамиСВременемФормирования.Вывести(ОбластьСтрокаОтклонения);
				Иначе
					ОшибкиСОтчетамиБезВремениФормирования.Вывести(ОбластьСтрокаОтклонения);
				КонецЕсли;
			Иначе
				БезОшибок.Вывести(ОбластьСтрокаОтклонения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Общие параметры
	ОбластьШапка.Параметры.Дата			= Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Организация	= ЭтотОбъект.Организация;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ГруппаОтчетов) Тогда
		ОбластьШапка.Параметры.ГруппаОтчетов = СтрШаблон(" по группе отчетов '%1'", ЭтотОбъект.ГруппаОтчетов);
	КонецЕсли;
	
	// Формирование
	ОбластьШапка.Параметры.ФормированиеПлан			= СоставИНастройкиОтчетов.Количество();
	ОбластьШапка.Параметры.ФормированиеФакт			= Сформировано;
	ОбластьШапка.Параметры.ФормированиеОтклонение	= СоставИНастройкиОтчетов.Количество() - Сформировано;
	
	Если ОбластьШапка.Параметры.ФормированиеОтклонение > 0 Тогда
		ОбластьШапка.Область(5, 6).ЦветТекста = ЦветОшибка;
	Иначе
		ОбластьШапка.Область(5, 6).ЦветТекста = ЦветУспешно;
	КонецЕсли;
	
	// Выгрузка в ЭДО
	ОбластьШапка.Параметры.ВыгрузкаПлан			= КВыгрузке;
	ОбластьШапка.Параметры.ВыгрузкаФакт			= Выгружено;
	ОбластьШапка.Параметры.ВыгрузкаОтклонение	= КВыгрузке - Выгружено;
	
	Если ОбластьШапка.Параметры.ВыгрузкаОтклонение > 0 Тогда
		ОбластьШапка.Область(6, 6).ЦветТекста = ЦветОшибка;
	Иначе
		ОбластьШапка.Область(6, 6).ЦветТекста = ЦветУспешно;
	КонецЕсли;
	
	// Отправка почтой
	ОбластьШапка.Параметры.ОтправкаПлан			= КОтправке;
	ОбластьШапка.Параметры.ОтправкаФакт			= Отправлено;
	ОбластьШапка.Параметры.ОтправкаОтклонение	= КОтправке - Отправлено;
	
	Если ОбластьШапка.Параметры.ОтправкаОтклонение > 0 Тогда
		ОбластьШапка.Область(7, 6).ЦветТекста = ЦветОшибка;
	Иначе
		ОбластьШапка.Область(7, 6).ЦветТекста = ЦветУспешно;
	КонецЕсли;
	
	ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы = ?(ВыводитьВсе, "Результаты:", "Отклонения:");
	
	Результат.Вывести(ОбластьШапка);
	
	Если ВыводитьВсе Или ОшибкиСОтчетамиБезВремениФормирования.ВысотаТаблицы > 0 Или ОшибкиСОтчетамиСВременемФормирования.ВысотаТаблицы > 0 Тогда
		Результат.Вывести(ОбластьШапкаТаблицы);
		Результат.Вывести(ОшибкиСОтчетамиБезВремениФормирования);
		Результат.Вывести(ОшибкиСОтчетамиСВременемФормирования);	
		Результат.Вывести(БезОшибок);
		Результат.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуДоговоровСОтчетамиСформированнымиДополнительно(Отбор, ЭкземплярыОтчетов, УчитываяСрокФормирования)
	
	Результат = Новый ТаблицаЗначений;
	
	Если Отбор = Неопределено Тогда		
		Возврат Результат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЭкземплярыОтчетов", 			ЭкземплярыОтчетов);
	Запрос.УстановитьПараметр("Организация",	 			ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", 				ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаОкончания", 				КонецДня(ЭтотОбъект.Дата));	
	Запрос.УстановитьПараметр("Субъекты", 					?(Отбор.Свойство("Договоры"), Отбор.Договоры, Неопределено));			
	Запрос.УстановитьПараметр("ВидыДоговоров",				?(Отбор.Свойство("ВидыДоговоров"), Отбор.ВидыДоговоров, Неопределено));	
	Запрос.УстановитьПараметр("СписокОтчетов",				?(Отбор.Свойство("СписокОтчетов"), Отбор.СписокОтчетов, Неопределено));		
	Запрос.УстановитьПараметр("ГруппаОтчетов", 				?(Отбор.Свойство("ГруппаОтчетов"), Отбор.ГруппаОтчетов, Неопределено));	
	Запрос.УстановитьПараметр("Периодичность", 				?(Отбор.Свойство("Периодичность"), Отбор.Периодичность, Неопределено));	
	Запрос.УстановитьПараметр("Клиенты", 					?(Отбор.Свойство("Клиенты"), Отбор.Клиенты, Неопределено));	
	Запрос.УстановитьПараметр("ОтборПоДоговорам", 			Запрос.Параметры.Субъекты <> Неопределено);
	Запрос.УстановитьПараметр("ОтборПоОтчетам", 			Запрос.Параметры.СписокОтчетов <> Неопределено);
	Запрос.УстановитьПараметр("ОтборПоВидамДоговоров", 		Запрос.Параметры.ВидыДоговоров <> Неопределено);
	Запрос.УстановитьПараметр("ОтборПоКлиентам", 			Запрос.Параметры.Клиенты <> Неопределено);

	Запрос.УстановитьПараметр("УчитываяСрокФормирования",	УчитываяСрокФормирования);
	
	// Найдем отчеты, соответствующие отбору, но у которых отчетная дата не соответствует периодичности
	// Для этого потребуются значения отдельных настроек,
	// чтобы правильно сопоставить периодичность с датой отчета
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЖурналСобытийСОтчетами.Экземпляр.Субъект КАК Субъект,
		|	ЖурналСобытийСОтчетами.Экземпляр.Отчет КАК Отчет,
		|	ЖурналСобытийСОтчетами.Экземпляр.Дата КАК Дата,
		|	ЖурналСобытийСОтчетами.Экземпляр.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ _ТаблицаОтчетов
		|ИЗ
		|	РегистрСведений.ЖурналСобытийСОтчетами КАК ЖурналСобытийСОтчетами
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &УчитываяСрокФормирования
		|				ТОГДА ЖурналСобытийСОтчетами.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЖурналСобытийСОтчетами.Экземпляр.Дата = &ДатаНачала
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборПоДоговорам
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЖурналСобытийСОтчетами.Экземпляр.Субъект В (&Субъекты)
		|		КОНЕЦ
		|	И НЕ ЖурналСобытийСОтчетами.Экземпляр В (&ЭкземплярыОтчетов)
		|	И ЖурналСобытийСОтчетами.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияСОтчетами.СозданиеВерсии)
		|	И ЖурналСобытийСОтчетами.Экземпляр.Организация = &Организация
		|	И ВЫБОР
		|			КОГДА &ГруппаОтчетов = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЖурналСобытийСОтчетами.Экземпляр.Отчет В ИЕРАРХИИ (&ГруппаОтчетов)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ &ОтборПоОтчетам
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЖурналСобытийСОтчетами.Экземпляр.Отчет В (&СписокОтчетов)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &Периодичность = НЕОПРЕДЕЛЕНО
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЖурналСобытийСОтчетами.Экземпляр.Периодичность В (&Периодичность)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаОтчетов.Субъект КАК Субъект,
		|	_ТаблицаОтчетов.Отчет КАК Отчет,
		|	_ТаблицаОтчетов.Дата КАК Дата,
		|	_ТаблицаОтчетов.Периодичность КАК Периодичность,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаКалендарныхДней.) КАК УчетКалендарныхДнейПриЕжедневномФормировании,
		|	ЗНАЧЕНИЕ(Перечисление.ВариантыОпределенияКонечнойДатыОтчета.) КАК ВариантОпределенияКонечнойДатыПриЕженедельномФормировании		
		|ИЗ
		|	_ТаблицаОтчетов КАК _ТаблицаОтчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И ВЫБОР
		|						КОГДА НЕ &ОтборПоДоговорам
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ СчетДоверительногоУправления В (&Субъекты)
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА НЕ &ОтборПоВидамДоговоров
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоров)
		|					КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО _ТаблицаОтчетов.Субъект = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|			И (ВЫБОР
		|				КОГДА НЕ &ОтборПоКлиентам
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ КлиентыДоверительногоУправленияСрезПоследних.Клиент В (&Клиенты)
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
	ТаблицаОтчетов = Запрос.Выполнить().Выгрузить();
	
	КоличествоОтчетов = ТаблицаОтчетов.Количество();
	
	Если КоличествоОтчетов = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("УчетКалендарныхДнейПриЕжедневномФормировании");
	МассивНастроек.Добавить("ВариантПолученияКонечнойДатыПриЕженедФормировании");
	
	Для Каждого СтрокаТаблицы Из ТаблицаОтчетов Цикл
		
		ЗначенияНастроек = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(ЭтотОбъект.Дата, СтрокаТаблицы.Субъект, СтрокаТаблицы.Отчет, СтрокаТаблицы.Периодичность, МассивНастроек);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЗначенияНастроек);
		
	КонецЦикла;
		
	Запрос.УстановитьПараметр("ТаблицаОтчетов",		ТаблицаОтчетов);
	Запрос.УстановитьПараметр("НачалоКалендаря", 	ТаблицаОтчетов[0].Дата);
	// Требуется следующий рабочий день, поэтому дату окончания сдвигаем на следующий рабочий день
	Запрос.УстановитьПараметр("КонецКалендаря", 	Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТаблицаОтчетов[КоличествоОтчетов - 1].Дата, 1));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтчетов.Субъект КАК Субъект,
		|	ТаблицаОтчетов.Отчет КАК Отчет,
		|	ТаблицаОтчетов.Дата КАК Дата,
		|	ТаблицаОтчетов.Периодичность КАК Периодичность,
		|	ТаблицаОтчетов.УчетКалендарныхДнейПриЕжедневномФормировании КАК УчетКалендарныхДнейПриЕжедневномФормировании,
		|	ТаблицаОтчетов.ВариантОпределенияКонечнойДатыПриЕженедельномФормировании КАК ВариантОпределенияКонечнойДатыПриЕженедельномФормировании
		|ПОМЕСТИТЬ _ТаблицаОтчетов
		|ИЗ
		|	&ТаблицаОтчетов КАК ТаблицаОтчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ИСТИНА КАК РабочийДень,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ _РабочиеДни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоКалендаря И &КонецКалендаря
		|	И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТаблицаОтчетов.Субъект КАК Договоры,
		|	_ТаблицаОтчетов.Дата КАК Дата,
		|	_ТаблицаОтчетов.Отчет КАК СписокОтчетов,
		|	_ТаблицаОтчетов.Периодичность КАК Периодичность
		|ИЗ
		|	_ТаблицаОтчетов КАК _ТаблицаОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РабочиеДни КАК _РабочиеДни
		|		ПО _ТаблицаОтчетов.Дата = _РабочиеДни.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РабочиеДни КАК _СледующийРабочийДень
		|		ПО (_РабочиеДни.НомерЗаписи + 1 = _СледующийРабочийДень.НомерЗаписи)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежедневно)
		|				ТОГДА ВЫБОР
		|						КОГДА _ТаблицаОтчетов.УчетКалендарныхДнейПриЕжедневномФормировании = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаКалендарныхДней.ВсеДни)
		|							ТОГДА ЛОЖЬ
		|						КОГДА _ТаблицаОтчетов.УчетКалендарныхДнейПриЕжедневномФормировании = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаКалендарныхДней.ТолькоРабочиеДниИКонецМесяца)
		|							ТОГДА ЕСТЬNULL(_РабочиеДни.РабочийДень, ЛОЖЬ) = ЛОЖЬ
		|									И КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) <> КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, МЕСЯЦ)
		|						ИНАЧЕ ЕСТЬNULL(_РабочиеДни.РабочийДень, ЛОЖЬ) = ЛОЖЬ
		|					КОНЕЦ
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Еженедельно)
		|				ТОГДА ВЫБОР
		|						КОГДА _ТаблицаОтчетов.ВариантОпределенияКонечнойДатыПриЕженедельномФормировании = ЗНАЧЕНИЕ(Перечисление.ВариантыОпределенияКонечнойДатыОтчета.ПоследнийРабочийДень)
		|							ТОГДА НЕ(ЕСТЬNULL(_РабочиеДни.РабочийДень, ЛОЖЬ) = ИСТИНА
		|										И КОНЕЦПЕРИОДА(_СледующийРабочийДень.Дата, ДЕНЬ) > КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, НЕДЕЛЯ))
		|						КОГДА _ТаблицаОтчетов.ВариантОпределенияКонечнойДатыПриЕженедельномФормировании = ЗНАЧЕНИЕ(Перечисление.ВариантыОпределенияКонечнойДатыОтчета.Среда)
		|							ТОГДА ДЕНЬНЕДЕЛИ(_ТаблицаОтчетов.Дата) <> 3
		|						ИНАЧЕ КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) <> КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, НЕДЕЛЯ)
		|					КОНЕЦ
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.ДваРазаВМесяц)
		|				ТОГДА НЕ(КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, МЕСЯЦ)
		|							ИЛИ МЕСЯЦ(_ТаблицаОтчетов.Дата) = 2
		|								И ДЕНЬ(_ТаблицаОтчетов.Дата) = 14
		|							ИЛИ ДЕНЬ(_ТаблицаОтчетов.Дата) = 15)
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежемесячно)
		|				ТОГДА КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) <> КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, МЕСЯЦ)
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежеквартально)
		|				ТОГДА КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) <> КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, КВАРТАЛ)
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.Ежегодно)
		|				ТОГДА КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) <> КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ГОД)
		|			КОГДА _ТаблицаОтчетов.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПредоставленияОтчетности.ПоДекадам)
		|				ТОГДА НЕ(КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, ДЕНЬ) = КОНЕЦПЕРИОДА(_ТаблицаОтчетов.Дата, МЕСЯЦ)
		|							ИЛИ ДЕНЬ(_ТаблицаОтчетов.Дата) = 10
		|							ИЛИ ДЕНЬ(_ТаблицаОтчетов.Дата) = 20)
		|		КОНЕЦ";
		    	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции
